Mockdev/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <attributes>
    <name>external_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>45</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>reference_number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>45</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>delivery_address</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>payment_type</name>
    <type>
      <types>EnumRef.ТипыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>payment_address</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>state</name>
    <type>
      <types>EnumRef.СостоянияЗаказовМагПэй</types>
    </type>
  </attributes>
  <attributes>
    <name>type</name>
    <type>
      <types>EnumRef.ТипыОперацийФискальногоРегистратораМагПэй</types>
    </type>
  </attributes>
  <attributes>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ref_id</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>items</name>
    <attributes>
      <name>nomenclature_id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>45</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>tax</name>
      <type>
        <types>EnumRef.ТипыНалоговМагПэй</types>
      </type>
    </attributes>
    <attributes>
      <name>quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Mockdev/src/Documents/ЗаказПоставщику/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура itemsquantityПриИзменении(Элемент)
	ТекущиеДанные = Элементы.items.ТекущиеДанные;
	ТекущиеДанные.sum = ТекущиеДанные.price * ТекущиеДанные.quantity;
	
	itemsquantityПриИзменении3(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура itemsquantityПриИзменении3(Элемент)
	ТекущиеДанные = Элементы.items.ТекущиеДанные;
	ТекущиеДанные.sum = ТекущиеДанные.price * ТекущиеДанные.quantity;
	
	itemsquantityПриИзменении33(Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура itemsquantityПриИзменении33(Элемент)
	ТекущиеДанные = Элементы.items.ТекущиеДанные;
	ТекущиеДанные.sum = ТекущиеДанные.price * ТекущиеДанные.quantity;
	
	
	
КонецПроцедуры

&НаСервере
Процедура имяПроцедуры(Параметры)
	
	запрос = новый Запрос("ВЫБРАТЬ
	|	Рейс.ВерсияДанных,
	|	Рейс.Дата
	|ИЗ
	|	Документ.Рейс КАК Рейс");
	
КонецПроцедуры
